src/Reports/ШтатноеРасписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ШтатноеРасписание</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВвода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВнешниеСовместители</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТарифныеСтавкиРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиРаботниковОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладСПовышениемВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесячнаяТарифнаяСтавкаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КоэфПовышенияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КоэфПовышенияТО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоэффициентыПовышения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПовышенияПоИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПовышенияПоИнструкции</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоэффициентыПовышения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Reports/ШтатноеРасписание/Ext/ObjectModule.bsl
Перем мМакет, ПараметрыНормыЧасов, ТаблицаПовышений, ТаблицаНадбавок, мНомер;
Перем МесФондИтогПоПредпр, МесФондВсегоИтогПоПредпр, СтавокИтогПоПредпр, ПремияИтогПоПредпр, СтавкаИтогПоПредпр;
Перем ТекПодр, ТЗ_ТаблицаПовышенийОр, СтавкаПервогоОсновная, ТЗ_ТарифныеСтавки;
Перем ТЗ_ПоПредприятию, ТЗ_ПоПодразделению;
Перем ТаблицаВакантно, ВременнаяТЗ, ТЗ_Декретницы;

#Если Клиент Тогда		

Процедура ВывестиСтрокиПодразделения(ВременнаяТЗ, ДокументРезультат)
	
	Для Каждого ТекСтрокаТЗ Из ВременнаяТЗ Цикл 
		СуммаПоКонтракту = 0;
		МесФонд = 0;
		Ставка = 0;
        МесФондВсего = 0;
		
		Если ТекПодр <> ТекСтрокаТЗ.Подразделение Тогда
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ПодразделениеОрганизацииКод = СокрЛП(ТекСтрокаТЗ.Подразделение.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ТекСтрокаТЗ.Подразделение.Наименование;				
			
	
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = 0;
			
		КонецЕсли;
		
		ТекПодр = ТекСтрокаТЗ.Подразделение;
		
		Если ЗначениеЗаполнено(ТекСтрокаТЗ.Должность) Тогда
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			
			мТарифнаяСтавка = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаТЗ.ТарифнаяСтавка,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			
			ОбластьДетальныхЗаписей.Параметры.Должность = ТекСтрокаТЗ.Должность;
			ОбластьДетальныхЗаписей.Параметры.ЗанимаемыхСтавок = ТекСтрокаТЗ.ЗанимаемыхСтавок;
			ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавка = мТарифнаяСтавка;
			
			ОбластьДетальныхЗаписей.Параметры.ПроцентПоКонтракту = ТекСтрокаТЗ.ПроцентПоКонтракту;
			СуммаПоКонтракту = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавка * ТекСтрокаТЗ.ПроцентПоКонтракту/100,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			ОбластьДетальныхЗаписей.Параметры.СуммаПоКонтракту = СуммаПоКонтракту;
			
			Ставка = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавка + СуммаПоКонтракту,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			ОбластьДетальныхЗаписей.Параметры.Ставка = Ставка;
			
			
			Надб = 0;
			СуммаНадб = 0; СуммаНадбПоСотруднику = 0;
			ПроцентПремии = 0;
			Премия = 0;
			
			Если ВидРасчета.Количество() > 0 Тогда
				Для Каждого ТекСтрока из ВидРасчета Цикл
					мСтрокаТЧ = ТаблицаНадбавок.НайтиСтроки(Новый Структура("Должность, ВидРасчета",  ТекСтрокаТЗ.Должность, ТекСтрока.Значение));
					Если мСтрокаТЧ.Количество() <> 0 Тогда
						Если Найти(нрег(ТекСтрока.Значение.Наименование),"премия") Тогда
							ПроцентПремии = ПроцентПремии + мСтрокаТЧ[0].Показатель;
							Премия = Премия + ОбщегоНазначения.ОкруглитьЗначение2016(Ставка * мСтрокаТЧ[0].Показатель / 100,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
							СуммаНадбПоСотруднику = СуммаНадбПоСотруднику + Премия;
						Иначе
							Надб = Надб + мСтрокаТЧ[0].Показатель;
							СуммаНадб = СуммаНадб + ОбщегоНазначения.ОкруглитьЗначение2016(Ставка * мСтрокаТЧ[0].Показатель / 100,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
							СуммаНадбПоСотруднику = СуммаНадбПоСотруднику + СуммаНадб;
						КонецЕсли;
					Иначе
						Надб = 0;
						СуммаНадб = 0;
						ПроцентПремии = 0;
						Премия = 0;
					КонецЕсли;
					
				КонецЦикла;		
			КонецЕсли;
			
			ОбластьДетальныхЗаписей.Параметры.Надб = Надб;
			ОбластьДетальныхЗаписей.Параметры.СуммаНадб = СуммаНадб;
			ОбластьДетальныхЗаписей.Параметры.Премия = Премия;
			ОбластьДетальныхЗаписей.Параметры.Примечание = ?(ПроцентПремии<>0,СокрЛП(ПроцентПремии)+"% премия","");
			МесФонд = ОбщегоНазначения.ОкруглитьЗначение2016(Ставка + СуммаНадбПоСотруднику,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			МесФонд = ?(ТекСтрокаТЗ.ЗанимаемыхСтавок<1,Окр(МесФонд/ТекСтрокаТЗ.ЗанимаемыхСтавок,2),МесФонд); //Аверсон 12.04.2023 КВВ СВФР-010676
			МесФондВсего = МесФонд * ТекСтрокаТЗ.ЗанимаемыхСтавок;
			ОбластьДетальныхЗаписей.Параметры.МесФондВсего = МесФондВсего;
			ОбластьДетальныхЗаписей.Параметры.МесФонд = МесФонд;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			//подсчитываем итоги 			
			СтавокИтогПоПредпр = СтавокИтогПоПредпр + ТекСтрокаТЗ.ЗанимаемыхСтавок;
			СтавкаИтогПоПредпр = СтавкаИтогПоПредпр + ТекСтрокаТЗ.Ставка;
			МесФондИтогПоПредпр = МесФондИтогПоПредпр + МесФонд;
			МесФондВсегоИтогПоПредпр = МесФондВсегоИтогПоПредпр + МесФондВсего;
			ПремияИтогПоПредпр = ПремияИтогПоПредпр + Премия;
			
		КонецЕсли;
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры

Процедура ЗаполнимВременнуюТаблицу(ВременнаяТЗ, ВыборкаСтрок)
	
	Пока ВыборкаСтрок.Следующий() Цикл 
		СуммаПоКонтракту = 0;
		Ставка = 0;
        МесФонд = 0;
		МесФондВсего = 0;
		
		НоваяСтрока = ВременнаяТЗ.Добавить();
		НоваяСтрока.Подразделение          = ВыборкаСтрок.ПодразделениеОрганизации;
		НоваяСтрока.ПриоритетПодразделение = ВыборкаСтрок.ПодразделениеОрганизацииПриоритет;
		//Аверсон-софт, Островская Татьяна 13.04.2012 
		НоваяСтрока.ПодразделениеОрганизацииКод = ВыборкаСтрок.ПодразделениеОрганизацииКод;
		//Аверсон-софт, Островская Татьяна 13.04.2012 
		
		Если ЗначениеЗаполнено(ВыборкаСтрок.Должность) Тогда
			
			НоваяСтрока.Должность              = ВыборкаСтрок.Должность;
			НоваяСтрока.ПриоритетДолжность     = ВыборкаСтрок.ДолжностьПриоритет;
			НоваяСтрока.ЗанимаемыхСтавок       = ВыборкаСтрок.ЗанимаемыхСтавок;
			мТарифнаяСтавка = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСтрок.ТарифнаяСтавка,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			НоваяСтрока.ТарифнаяСтавка   = мТарифнаяСтавка;
			НоваяСтрока.ПроцентПоКонтракту     = ВыборкаСтрок.ПроцентПоКонтракту;
			СуммаПоКонтракту = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавка * ВыборкаСтрок.ПроцентПоКонтракту/100,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949 
			НоваяСтрока.СуммаПоКонтракту = СуммаПоКонтракту;
			Ставка = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавка + СуммаПоКонтракту,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			НоваяСтрока.Ставка = Ставка;
			
			СуммаНадбПоСотруднику = 0;
			Если ВидРасчета.Количество() > 0 Тогда
				Для Каждого ТекСтрока из ВидРасчета Цикл
					СуммаНадб = 0; 
					мСтрокаТЧ = ТаблицаНадбавок.НайтиСтроки(Новый Структура("Должность, ВидРасчета", ВыборкаСтрок.Должность, ТекСтрока.Значение));
					Если мСтрокаТЧ.Количество() <> 0 Тогда
						СуммаНадб = ОбщегоНазначения.ОкруглитьЗначение2016(Ставка * мСтрокаТЧ[0].Показатель / 100,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
					Иначе
						СуммаНадб = 0;
					КонецЕсли;
					СуммаНадбПоСотруднику = СуммаНадбПоСотруднику + СуммаНадб;
				КонецЦикла;		
			КонецЕсли;
			
			МесФонд = Ставка + СуммаНадбПоСотруднику;
			МесФонд = ?(ВыборкаСтрок.ЗанимаемыхСтавок<1,Окр(МесФонд/ВыборкаСтрок.ЗанимаемыхСтавок,2),МесФонд); //Аверсон 12.04.2023 КВВ СВФР-010676
			МесФондВсего = (Ставка + СуммаНадбПоСотруднику)*ВыборкаСтрок.ЗанимаемыхСтавок;
			НоваяСтрока.МесФонд                = МесФонд;
			НоваяСтрока.МесФондВсего           = МесФондВсего;
		КонецЕсли;
	КонецЦикла;	
	
	//Аверсон 18.01.2023 КВВ СВФР-010160 (
	//Аверсон-софт, Островская Татьяна 05.04.2012 
	//ВременнаяТЗ.Сортировать("ПодразделениеОрганизацииКод");
	//Аверсон-софт, Островская Татьяна 05.04.2012
	
	ВременнаяТЗ.Сортировать("ПриоритетПодразделение,Подразделение,ПриоритетДолжность,Должность");	
	//Аверсон 18.01.2023 КВВ СВФР-010160 )
	
	ВременнаяТЗ.Свернуть("ПриоритетПодразделение,Подразделение,ПриоритетДолжность,Должность,ТарифнаяСтавка,ПроцентПоКонтракту,СуммаПоКонтракту,Ставка,МесФонд","ЗанимаемыхСтавок,МесФондВсего");
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	МесФондИтогПоПредпр = 0; МесФондВсегоИтогПоПредпр = 0; СтавокИтогПоПредпр = 0; СтавкаИтогПоПредпр = 0; ПремияИтогПоПредпр = 0;
	ТекПодр = "";
	
	ТЗ_ПоПредприятию = Новый ТаблицаЗначений;
	ТЗ_ПоПредприятию.Колонки.Добавить("ВидРасчета");
	ТЗ_ПоПредприятию.Колонки.Добавить("Сумма");
	
	ТЗ_ПоПодразделению = Новый ТаблицаЗначений;
	ТЗ_ПоПодразделению.Колонки.Добавить("ВидРасчета");
	ТЗ_ПоПодразделению.Колонки.Добавить("Сумма");
	
	РуководительФИО =""; ДолжностьРуководитель = "";
	Если ЗначениеЗаполнено(Организация) Тогда 
		СпрОрганизации = Организация.ПолучитьОбъект();
	иначе
		СпрОрганизации = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; 
	Для Каждого НоваяСтр из ТЗ Цикл
		Если ДатаАктуальности >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ДолжностьРуководитель = СокрЛП(НоваяСтр.Должность.Наименование);
				РуководительНашли = 1;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
	Запрос = Новый Запрос;
	Если Факт Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность.Приоритет КАК ДолжностьПриоритет,
		|	РаботникиОрганизации.Должность КАК Должность,
		|	РаботникиОрганизации.Категория,
		|	ТарифныеСтавкиРаботниковОрганизации.Ставка КАК Ставка,
		|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка КАК ТарифнаяСтавка,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции КАК ТарифнаяСПовышениемПоИнструкции,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	РаботникиОрганизации.Сотрудник КАК СотрудникНаименование,
		|	РаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, НЕ Временно) КАК РаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизации
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета КАК ВидРасчета,
		|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор КАК Ссылка
		|			ИЗ
		|				РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, НЕ временно) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|			ГДЕ
		|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
		|				И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО) КАК ВидТС
		|			ПО ТарифныеСтавкиРаботниковОрганизации.Сотрудник = ВидТС.Сотрудник
		|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
		|ГДЕ
		|	НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL 
		|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ <> 0
		//О.Т. Аверсон 06.02.2018 № 1545 убран код
		//|	И НЕ РаботникиОрганизации.Сотрудник В
		//|				(ВЫБРАТЬ
		//|					СостояниеРаботниковОрганизаций.Сотрудник
		//|				ИЗ
		//|					РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		//|				ГДЕ
		//|					СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		//|					И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения)
		|	И РаботникиОрганизации.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)";
		
		Если Не ФлагВнешниеСовместители Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность.Приоритет,
		|	РаботникиОрганизации.Должность,
		|	РаботникиОрганизации.Сотрудник,
		|	РаботникиОрганизации.Категория,
		|	ТарифныеСтавкиРаботниковОрганизации.Ставка,
		|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Код,			
		|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование,
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ,
		|	РаботникиОрганизации.СотрудникЗаменяемый
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизацииПриоритет Возр,
		|	ДолжностьПриоритет Возр,
		|	Должность,
		|	Сотрудник
		|ИТОГИ
		|	СУММА(ТарифнаяСПовышениемПоИнструкции)
		|ПО
		|	ПодразделениеОрганизации ИЕРАРХИЯ";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Сотрудник КАК СотрудникНаименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Приоритет КАК ДолжностьПриоритет,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Должность,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Категория,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка КАК ТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка КАК Ставка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции КАК ТарифныйСПовышениемПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КодСтроки КАК Сотрудник,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор КАК Документ,
		|МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Период) КАК Период //СВЭЙ 15.07.2024 КВВ СВФР-013336
		|ИЗ
		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
		
		//СВЭЙ 15.07.2024 КВВ СВФР-013336 (
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|(
		|ВЫБРАТЬ
		|ПланШРСрезП.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|ПланШРСрезП.Должность КАК Должность,
		|МАКСИМУМ(ПланШРСрезП.Период) КАК Период
		|ИЗ РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период,) КАК ПланШРСрезП
		|ГДЕ
		|ПланШРСрезП.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)
		|И ПланШРСрезП.ЗанимаемыхСтавок <> 0
		|СГРУППИРОВАТЬ ПО
		|ПланШРСрезП.ПодразделениеОрганизации,
		|ПланШРСрезП.Должность 
		|) КАК ВложжЗапрос
		|ПО ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВложжЗапрос.ПодразделениеОрганизации
		|И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВложжЗапрос.Должность
		|И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Период = ВложжЗапрос.Период
		//СВЭЙ 15.07.2024 КВВ СВФР-013336 )
		
		|ГДЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
		|	И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Приоритет,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Сотрудник,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Категория,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КодСтроки,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизацииПриоритет,
		|	ДолжностьПриоритет,
		|	Должность,
		|	СотрудникНаименование
		|ИТОГИ
		|	СУММА(ТарифныйСПовышениемПоИнструкции)
		|ПО
		|	ПодразделениеОрганизации ИЕРАРХИЯ";
	КонецЕсли;			
	
	Запрос.УстановитьПараметр("Период",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);   
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)")
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапросаНов = Запрос.Выполнить().Выбрать();
	ТЗ_Сотрудник = Новый ТаблицаЗначений;
	ТЗ_Сотрудник = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТЗ_Сотрудник.Свернуть("Сотрудник","");
	
	
	ЗапросП = Новый Запрос;
	Если Факт Тогда
		ЗапросП.Текст =
		"ВЫБРАТЬ
		|	КоэфПовышенияТОСрезПоследних.Сотрудник,
		|	КоэфПовышенияТОСрезПоследних.Коэффициент,
		|	КоэфПовышенияТОСрезПоследних.Размер
		|ИЗ
		|	РегистрСведений.КоэфПовышенияТО.СрезПоследних(&Период, (НЕ Временно)) КАК КоэфПовышенияТОСрезПоследних
		|ГДЕ
		|	КоэфПовышенияТОСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПовышенияПоИнструкцииСрезПоследних.Сотрудник,
		|	ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
		|	ПовышенияПоИнструкцииСрезПоследних.Размер
		|ИЗ
		|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Период, (НЕ Временно)) КАК ПовышенияПоИнструкцииСрезПоследних
		|ГДЕ
		|	ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И ПовышенияПоИнструкцииСрезПоследних.Размер <> 0";
	Иначе
		ЗапросП.Текст =
		"ВЫБРАТЬ
		|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Коэффициент,
		|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Размер,
		|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.КодСтроки КАК Сотрудник
		|ИЗ
		|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.КоэфПовышенияТО КАК ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО
		|ГДЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Ссылка В(&Документ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Коэффициент,
		|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер,
		|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.КодСтроки
		|ИЗ
		|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции
		|ГДЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Ссылка В(&Документ)
		|	И ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер <> 0";
		ЗапросП.УстановитьПараметр("Документ",	РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ"));
	КонецЕсли;
	ЗапросП.УстановитьПараметр("Период",	ДатаАктуальности);
	ЗапросП.УстановитьПараметр("КодСтрокиСотрудник",	ТЗ_Сотрудник);
	
	ТаблицаПовышений = ЗапросП.Выполнить().Выгрузить();
	
	ТЗ_ТаблицаПовышений = Новый ТаблицаЗначений;
	ТЗ_ТаблицаПовышений = ЗапросП.Выполнить().Выгрузить();
	ТЗ_ТаблицаПовышенийОр = Новый ТаблицаЗначений;
	ТЗ_ТаблицаПовышенийОр.Колонки.Добавить("Коэффициент");
	
	Для Каждого СтрТЗ из ТЗ_ТаблицаПовышений Цикл
		НайденнаяСтр = ТЗ_Сотрудник.Найти(СтрТЗ.Сотрудник,"Сотрудник");
		Если НайденнаяСтр = Неопределено Тогда
		Иначе
			СтрТЗОр = ТЗ_ТаблицаПовышенийОр.Добавить();
			СтрТЗОр.Коэффициент = СтрТЗ.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	
	ТЗ_ТаблицаПовышенийОр.Свернуть("Коэффициент","");
	
	Если Факт Тогда
		ЗапросП = Новый Запрос;
		ЗапросП.Текст =
		
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Должность КАК Должность,
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1, 0) = 0
		|			ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2
		|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
		|	КОНЕЦ КАК Показатель
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, НЕ Временно) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
		|			И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = РаботникиОрганизаций.Организация
		|ГДЕ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
		|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)";
		
		ЗапросП.УстановитьПараметр("Период",	ДатаАктуальности);
		ЗапросП.УстановитьПараметр("Организация",		Организация);   	
		ЗапросП.УстановитьПараметр("ВидРасчета", ВидРасчета);
		
	Иначе
		ЗапросП.Текст =
		"ВЫБРАТЬ
		|	ПлановоеШтатноеРасписаниеОрганизацийНадбавки.КодСтроки КАК Сотрудник,
		|   ПлановоеШтатноеРасписаниеОрганизацийНадбавки.ВидНадбавки КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель1, 0) = 0
		|			ТОГДА ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель2
		|		ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель1            
		|	КОНЕЦ КАК Показатель
		|ИЗ
		|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.Надбавки КАК ПлановоеШтатноеРасписаниеОрганизацийНадбавки
		|ГДЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Ссылка В(&Документ)";
		ЗапросП.УстановитьПараметр("Документ",	РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ"));
	КонецЕсли;
	ТаблицаНадбавок = ЗапросП.Выполнить().Выгрузить();
	
	Если Факт Тогда
		ТаблицаНадбавок.Свернуть("Должность,ВидРасчета,Показатель");
	иначе
		ТаблицаНадбавок.Свернуть("ВидРасчета,Показатель");
	КонецЕсли;
	
	ВременнаяТЗ = Новый ТаблицаЗначений;
	ВременнаяТЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	ВременнаяТЗ.Колонки.Добавить("ПодразделениеОрганизацииКод", Новый ОписаниеТипов("Строка"));
	
	ВременнаяТЗ.Колонки.Добавить("ПриоритетПодразделение", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.ДолжностиОрганизаций"));
	ВременнаяТЗ.Колонки.Добавить("ПриоритетДолжность", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ЗанимаемыхСтавок", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ТарифнаяСтавка", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ПроцентПоКонтракту", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("СуммаПоКонтракту", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("Ставка",Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("МесФонд", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("МесФондВсего", Новый ОписаниеТипов("Число"));
	
	ЗаполнимВременнуюТаблицу(ВременнаяТЗ, РезультатЗапроса.Выбрать());
	
	//////////////////////////////////////////////////////////
	ДокументРезультат.Очистить();
	
	Область = мМакет.ПолучитьОбласть("Заголовок");
	
	Область.Параметры.ДолжностьРуководитель = ДолжностьРуководитель;
	Область.Параметры.РуководительФИО = РуководительФИО;
	Область.Параметры.ДатаУтверждения = Формат(Год(ДатаАктуальности),"ЧГ=0");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.ПериодТС = Формат(ДатаВвода,"ДЛФ=DD");
	
	ДокументРезультат.Вывести(Область);
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб        = Истина;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
	
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВременнаяТЗ, ДокументРезультат);
	
	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию");
	Область.Параметры.СтавокИтогПоПредпр = СтавокИтогПоПредпр;
	Область.Параметры.СтавкаИтогПоПредпр = СтавкаИтогПоПредпр;
	Область.Параметры.ПремияИтогПоПредпр = ПремияИтогПоПредпр;
	Область.Параметры.МесФондИтогПоПредпр = МесФондИтогПоПредпр;
	Область.Параметры.МесФондВсегоИтогПоПредпр = МесФондВсегоИтогПоПредпр;
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("Подписи");
	ВыборкаРезультат = ПрочиеПроцедуры.СформироватьЗапросПоОтветственнымЛицамОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.НачальникУправленияЭкономики, ДатаАктуальности).Выбрать();
	Если ВыборкаРезультат.Следующий() Тогда
		Область.Параметры.ГлавныйЭкономист =СокрЛП(ВыборкаРезультат.Должность)+" "+ ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаРезультат.Сотрудник.Наименование);
	Иначе
		Область.Параметры.ГлавныйЭкономист = "";
	КонецЕсли;
	ВыборкаРезультат = ПрочиеПроцедуры.СформироватьЗапросПоОтветственнымЛицамОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ДатаАктуальности).Выбрать();
	Если ВыборкаРезультат.Следующий() Тогда
		Область.Параметры.ГлавныйБухгалтер =СокрЛП(ВыборкаРезультат.Должность)+" "+ ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаРезультат.Сотрудник.Наименование);
	Иначе
		Область.Параметры.ГлавныйБухгалтер = "";
	КонецЕсли;
	
	ДокументРезультат.Вывести(Область);

КонецПроцедуры

мМакет = ПолучитьМакет("МакетРабочие");

#КонецЕсли
